# Importing Libraries, Setting Helper Fucnctions and Reading in Data

In [1]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sn

import math
import os
import statistics
import scipy.stats as stats
from scipy.stats import chi2_contingency
from scipy.stats import anderson

from sklearn import preprocessing
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import StandardScaler

from sklearn.model_selection import GridSearchCV
from sklearn import svm
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import recall_score
from sklearn.metrics import make_scorer


# an initial clean-up function
def clean_up(df,ds='rawdata1'):
    df["YEAR"] = df["YEAR"].astype('str')
    df["MONTH"] = df["MONTH"].astype('str')
    df["DATE"] = df["MONTH"] + '-' + df["YEAR"]
    df["DATE"] =  pd.to_datetime(df["DATE"], format="%m-%Y")
    df['half year'] = np.where(df['DATE'].dt.month.le(6), 'H1', 'H2')
    col = df['half year'] + '-' + df["YEAR"]
    
    if ds == 'rawdata1':
        df["CATEGORY_ID"] = df["CATEGORY_ID"].astype('str')
        df.insert(1,'HALF YEAR',col)
    else:
        df.insert(0,'HALF YEAR',col)
        
    df = df.drop(['YEAR','MONTH','half year'], axis=1)
    df = df.set_index('DATE')
    
    df["STORE"] = df["STORE"].astype('int')
    df["DAYPART"] = df["DAYPART"].astype('str')
    
    return df


# a function to produce pivot tables
def piv_fun(rawdata_1,rawdata_2, piv_type='store'):
    
    daypart_list = ['B','L','D']
    category_list = ['10','15','20','25','30','40','45','50','55','60','99']
    helper_list = ['B','L','D','store']

    if piv_type=='store':
        rawdata_1_filt = rawdata_1
        rawdata_2_filt = rawdata_2
    elif piv_type in daypart_list:
        rawdata_1_filt = rawdata_1[rawdata_1['DAYPART']==piv_type]
        rawdata_2_filt = rawdata_2[rawdata_2['DAYPART']==piv_type]
    else:
        rawdata_1_filt = rawdata_1[rawdata_1['CATEGORY_ID']==piv_type]
  
    # revenue pivot
    rawdata_1_filt_rev = pd.pivot_table(rawdata_1_filt, values='REVENUE_NET', index=['DATE'],
                       columns=['STORE'], aggfunc="sum")
    rawdata_1_filt_rev.columns.name = None
    rawdata_1_filt_rev['Str Smpl Total']= rawdata_1_filt_rev.iloc[:,:].sum(axis=1)
    rawdata_1_filt_rev['Columbus_Region']= rawdata_1_filt_rev.iloc[:,2:4].sum(axis=1)

    # quantity pivot
    rawdata_1_filt_quan = pd.pivot_table(rawdata_1_filt, values='QTY', index=['DATE'],
                       columns=['STORE'], aggfunc="sum")
    rawdata_1_filt_quan.columns.name = None
    rawdata_1_filt_quan['Str Smpl Total']= rawdata_1_filt_quan.iloc[:,:].sum(axis=1)
    rawdata_1_filt_quan['Columbus_Region']= rawdata_1_filt_quan.iloc[:,2:4].sum(axis=1)
    
    # customer count pivot
    if piv_type in helper_list:
        rawdata_2_custcnt = pd.pivot_table(rawdata_2_filt, values='CUSTOMER_COUNT', index=['DATE'],
                           columns=['STORE'], aggfunc="sum")
        rawdata_2_custcnt.columns.name = None
        rawdata_2_custcnt['Str Smpl Total']= rawdata_2_custcnt.iloc[:,:].sum(axis=1)
        rawdata_2_custcnt['Columbus_Region']= rawdata_2_custcnt.iloc[:,2:4].sum(axis=1)

    else:
        rawdata_2_custcnt = None
    
    return rawdata_1_filt_rev,rawdata_1_filt_quan,rawdata_2_custcnt

    
def plot_fun2(df,i,store,ax):
    
    if i==0:
        ax.plot(df[store])
        ax.set_ylim(bottom = 0)
        ax.set_title('Total Revenues')
        ax.tick_params(axis='x', rotation=45)

    if i==1:
        ax.plot(df[store])
        ax.set_ylim(bottom = 0)
        ax.set_title('Total Quantity')
        ax.tick_params(axis='x', rotation=45)
        
    if i+1==3:
        ax.plot(df[store])
        ax.set_title('Average Prices')
        ax.tick_params(axis='x', rotation=45)            
        

# Settings
pd.set_option('display.max_columns', 50)
os.chdir('C:/Users/darre/Documents/Restaurant-Pricing')

In [2]:
def plot_fun1(df,store,ax,**kwargs):
    
    # creating dictionaries to help with subplot titles
    dict_daypart = {0: 'Breakfast',
        1: 'Lunch',
        2: 'Dinner'}
    
    dict_category = {0: 'BREAKFAST',
        1: 'SENIORS MEALS',
        2: 'DINNER',
        3: 'DINNER ALA',
        4: 'LUNCH',
        5: 'SOUP SALAD',
        6: 'KIDS',
        7: 'BEVERAGE',
        8: 'DESSERTS',
        9: 'BRKFST ALA',
       }
    
    # plotting Revenue
    ax.plot(df[0][store],label = 'Net Revenue ($)')
    ax.set_ylim(bottom = 0)

    # plotting Quantity
    ax.plot(df[1][store],label = 'Quantity (units)')

    # plotting Customer Counts
    ax.plot(df[2][store],label = 'Customer Count (units)')
    
    ax.tick_params(axis='x', rotation=45)
    
    # plotting Average Price / Unit
    ax2 = ax.twinx()  # instantiate a second axes that shares the same x-axis
    color='tab:red'
    ax2.plot(df[3][store],color=color,linestyle = '--',label='Average Price / Unit ($)')
    ax2.tick_params(axis='y', labelcolor=color)
    ax2.set_ylim(bottom = 0)

    # attending subplot titles
    if kwargs.get('type')=='dp':
        i = kwargs.get('plot_num')
        title = dict_daypart.get(i)
        ax.set_title(title,loc='left')
    if kwargs.get('type')=='cat':
        i = kwargs.get('plot_num')
        title = dict_category.get(i)
        ax.set_title(title)    
    
    # attending legend
    if kwargs.get('type')=='dp':  
        ax.legend(bbox_to_anchor=(1.43,0.9),
          frameon=True)
        ax2.legend(bbox_to_anchor=(1.43,0.4),
              frameon=True)
    elif kwargs.get('type')=='cat':
        pass
    else:
        ax.legend(bbox_to_anchor=(1.52,0.9),
          frameon=True)
        ax2.legend(bbox_to_anchor=(1.52,0.6),
          frameon=True)

In [3]:
rawdata1 = pd.read_csv('RAWDATA1.csv')
rawdata2 = pd.read_csv('RAWDATA2.csv')
rawdata3 = pd.read_csv('RAWDATA3.csv')
rawdata4 = pd.read_csv('RAWDATA4.csv')

# Clean-Up on Data

## RawDate1

In [4]:
rawdata1.head(3)

   YEAR  MONTH  STORE DAYPART  CATEGORY_ID  REVENUE_NET   QTY
0  2018      1      1       B           10        11700  2050
1  2018      1      1       D           10         3700   570
2  2018      1      1       L           10         7700  1270

In [5]:
rawdata1 = clean_up(rawdata1,ds='rawdata1')
rawdata1.head(3)

           HALF YEAR  STORE DAYPART CATEGORY_ID  REVENUE_NET   QTY
DATE
2018-01-01   H1-2018      1       B          10        11700  2050
2018-01-01   H1-2018      1       D          10         3700   570
2018-01-01   H1-2018      1       L          10         7700  1270

In [6]:
rawdata1['Avg_Price'] = round(rawdata1['REVENUE_NET'] / rawdata1['QTY'],2)
rawdata1.head(3)

           HALF YEAR  STORE DAYPART CATEGORY_ID  REVENUE_NET   QTY  Avg_Price
DATE
2018-01-01   H1-2018      1       B          10        11700  2050       5.71
2018-01-01   H1-2018      1       D          10         3700   570       6.49
2018-01-01   H1-2018      1       L          10         7700  1270       6.06

## RawDate2

In [7]:
rawdata2.head(3)

   STORE DAYPART  YEAR  MONTH  CUSTOMER_COUNT
0      1       B  2018      1            3312
1      1       B  2018      2            3366
2      1       B  2018      3            4116

In [8]:
rawdata2 = clean_up(rawdata2,ds='rawdata2')
rawdata2.head(3)

           HALF YEAR  STORE DAYPART  CUSTOMER_COUNT
DATE
2018-01-01   H1-2018      1       B            3312
2018-02-01   H1-2018      1       B            3366
2018-03-01   H1-2018      1       B            4116

## RawDate3

In [9]:
rawdata3 = rawdata3.set_index('STORE')
rawdata3.head(3)

              CITY STATE         NAME  AREA REGIONAL_DIRECTOR           REGION
STORE
1       RIO GRANDE    OH   RIO GRANDE     1        GREEN, JOE       GRANDE, OH
2      CHILLICOTHE    OH  CHILLICOTHE    26     YELLOW, JAMES  CHILLICOTHE, OH
3         COLUMBUS    OH    ROUTE 161     7     YELLOW, JAMES     COLUMBUS, OH

## RawDate4

In [10]:
rawdata4 = rawdata4.set_index('CATEGORY_ID')
rawdata4.head(4)

             CATEGORY_DESC                 COMMENTS
CATEGORY_ID
10               BREAKFAST          Breakfast items
15           SENIORS MEALS            Seniors Meals
20                  DINNER             Dinner items
25              DINNER ALA  Dinner a-la carte items

## Creating Pivot Tables

In [11]:
# store level pivots
df_store_list = piv_fun(rawdata1,rawdata2, piv_type='store')

# daypart level pivots
df_brkfst_list = piv_fun(rawdata1,rawdata2, piv_type='B')
df_lnch_list = piv_fun(rawdata1,rawdata2, piv_type='L')
df_dnr_list = piv_fun(rawdata1,rawdata2, piv_type='D')

daypart_list = [df_brkfst_list,df_lnch_list,df_dnr_list]

# category level pivots
df_10_list = piv_fun(rawdata1,rawdata2, piv_type='10')
df_15_list = piv_fun(rawdata1,rawdata2, piv_type='15')
df_20_list = piv_fun(rawdata1,rawdata2, piv_type='20')
df_25_list = piv_fun(rawdata1,rawdata2, piv_type='25')
df_30_list = piv_fun(rawdata1,rawdata2, piv_type='30')
df_40_list = piv_fun(rawdata1,rawdata2, piv_type='40')
df_45_list = piv_fun(rawdata1,rawdata2, piv_type='45')
df_50_list = piv_fun(rawdata1,rawdata2, piv_type='50')
df_55_list = piv_fun(rawdata1,rawdata2, piv_type='55')
df_60_list = piv_fun(rawdata1,rawdata2, piv_type='60')
df_99_list = piv_fun(rawdata1,rawdata2, piv_type='99')

In [ ]:
df

In [ ]:
df['Fruit Total2']= df.iloc[:,2:4].sum(axis=1)

In [17]:
gb1 = rawdata1.groupby(['HALF YEAR','STORE'])['REVENUE_NET'].sum()

In [18]:
gb1

HALF YEAR  STORE
H1-2018    1         800400
           2        1045700
           3         821000
           4         455600
           5         997600
           6         881100
           7        1198000
           8         632300
           9         608500
           10        932500
H1-2019    1         808900
           2        1121200
           3         839600
           4         483600
           5         910700
           6         892300
           7        1295900
           8         648400
           9         621900
           10        868700
H2-2018    1         875000
           2        1149800
           3         875300
           4         473600
           5        1000400
           6         914000
           7        1303000
           8         679900
           9         621700
           10        951900
Name: REVENUE_NET, dtype: int64

# System Level Review

In [ ]:
a = df['sum'] = df[cols].sum(axis=1)

In [13]:
a = df_store_list[0]

In [14]:
a

,1,2,3,4,5,6,7,8,9,10,Str Smpl Total,Columbus_Region
DATE,,,,,,,,,,,,
2018-01-01,113200,173900,124900,78300,173300,146600,206900,105400,99900,158000,1380400,203200
2018-02-01,108700,161800,124700,75700,162300,136600,184700,94500,94200,141300,1284500,200400
2018-03-01,129200,177400,148700,77700,167800,148500,198100,105500,103400,159000,1415300,226400
2018-04-01,143200,174200,146500,74800,165900,147400,201400,105700,102500,158200,1419800,221300
2018-05-01,152000,180400,135200,76700,166700,150200,206400,112000,103000,158800,1441400,211900
2018-06-01,154100,178000,141000,72400,161600,151800,200500,109200,105500,157200,1431300,213400
2018-07-01,161600,187900,162300,82400,163600,167700,206100,121100,113500,157800,1524000,244700
2018-08-01,153500,183100,147400,74400,163400,148100,213900,116700,106200,156800,1463500,221800
2018-09-01,150300,191500,138600,75600,166600,148100,214700,107700,100300,162300,1455700,214200
2018-10-01,163100,195100,172300,79700,170700,156600,220600,114100,106400,166300,1544900,252000
2018-11-01,126600,182100,131600,75900,161500,142300,214200,105600,94600,150300,1384700,207500
2018-12-01,119900,210100,123100,85600,174600,151200,233500,114700,100700,158400,1471800,208700
2019-01-01,115000,184300,129900,75900,161200,153300,221300,107000,100700,151800,1400400,205800
2019-02-01,103300,166600,123600,76700,146500,136300,196700,95900,92000,131900,1269500,200300
2019-03-01,134200,196100,154700,87900,159700,150200,221000,115400,105100,153800,1478100,242600
2019-04-01,145700,185200,143600,83000,147700,147400,210300,108600,105000,144400,1420900,226600
2019-05-01,152300,192700,142100,78600,148200,149300,221400,106900,104700,147800,1444000,220700
2019-06-01,158400,196300,145700,81500,147400,155800,225200,114600,114400,139000,1478300,227200

# Plotting Data

## Store 1

In [ ]:
store = '10'
fig = plt.figure(figsize=(7,4)) # creating the figure object
ax = fig.add_subplot()
fig.suptitle('Store 1: Overall View', # title for the figure
              fontsize = 15,
              x = 0.1,
              y = 1.0)

plot_fun1(df_store_list,store,ax)

In [ ]:
fig, axes = plt.subplots(3,1, figsize=(7.5,7.5),sharex=True)
axes = axes.flatten()
fig.suptitle('Store 1: Daypart View', # title for the figure
              fontsize = 15,
              x = 0.1,
              y = 1.0)

for i,axe in enumerate(axes):
    plot_fun1(daypart_list[i],store,axe,plot_num = i,type='dp')

In [ ]:
df_store_list[0]

In [ ]:
df_store_list[1]

In [ ]:
df_store_list[3]

### Breakfast Level

In [ ]:
fig, axes = plt.subplots(1,4, figsize=(18, 4))
axes = axes.flatten()

for i,axe in enumerate(axes):
    plot_fun1(df_brkfst_list[i],i,store, axe)

### Lunch Level

In [ ]:
fig, axes = plt.subplots(1,4, figsize=(18, 4))
axes = axes.flatten()

for i,axe in enumerate(axes):
    plot_fun1(df_lnch_list[i],i,store, axe)

### Dinner Level

In [ ]:
fig, axes = plt.subplots(1,4, figsize=(18, 4))
axes = axes.flatten()

for i,axe in enumerate(axes):
    plot_fun1(df_dnr_list[i],i,store, axe)

### 10 Level

In [ ]:
fig, axes = plt.subplots(1,3, figsize=(18, 4))
axes = axes.flatten()

for i,axe in enumerate(axes):
    plot_fun2(df_10_list[i],i,store, axe)